In [10]:
import pandas as pd
import numpy as np

# 数据写入

In [11]:
# df = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')

In [12]:
#df

In [13]:
#pd = pd.read_table('D:\\vscode_code\\数据集\\ch2\\my_table.txt')

# 数据写出

In [14]:
#df.to_csv('D:\\vscode_code\\数据集\\test.csv',index = False)

In [15]:
#基础数据结构

# series

In [16]:
s = pd.Series(data = ['1',2,{'dic':3}],
              index = ['line0','line1','line2'],
              name = 'line',
              dtype = 'object')

In [17]:
s

line0             1
line1             2
line2    {'dic': 3}
Name: line, dtype: object

In [18]:
s.name

'line'

In [19]:
s.dtype

dtype('O')

In [20]:
s.index

Index(['line0', 'line1', 'line2'], dtype='object')

In [21]:
s.values

array(['1', 2, {'dic': 3}], dtype=object)

# dataFrame

In [22]:
df = pd.DataFrame(data = [[1,2,3],
                          [4,5,6],
                          [7,8,9]],
                  index = pd.Index(['ln0','ln1','ln2']),
                  columns = pd.Index(['col1','col2','col3']))

In [23]:
df

     col1  col2  col3
ln0     1     2     3
ln1     4     5     6
ln2     7     8     9

In [24]:
df_str = pd.DataFrame(data ={'col1' :['a','b','c'],
                           'col3' : ['ca','ac','cd'],
                           'col2' : ['p','java','python']},
                    index = ['%d'%i for i in range(3)]
                    )

In [25]:
df_str

  col1 col3    col2
0    a   ca       p
1    b   ac    java
2    c   cd  python

In [26]:
df1 = pd.DataFrame(data = [[1,2,3],
                           [4,5,6],
                           [7,8,9]],
                    index = ['(%d)'%i for i in range(3)],
                    columns = ['col1','col2','col3'])

In [27]:
df1

     col1  col2  col3
(0)     1     2     3
(1)     4     5     6
(2)     7     8     9

In [28]:
df.index

Index(['ln0', 'ln1', 'ln2'], dtype='object')

In [29]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [30]:
df.values #dataFrame 的值

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [31]:
df.dtypes #dataFrame 的类型

col1    int64
col2    int64
col3    int64
dtype: object

In [32]:
df.shape #dataFrame 的长度

(3, 3)

In [33]:
df.T #dataFrame 的 转置

      ln0  ln1  ln2
col1    1    4    7
col2    2    5    8
col3    3    6    9

In [34]:
df = df[df.columns[:2]]

In [35]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

## 汇总函数

In [36]:
df.head() #默认前5行

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [37]:
df.head(2) #前2行数据

     col1  col2
ln0     1     2
ln1     4     5

In [38]:
df.tail(2) #后2行数据

     col1  col2
ln1     4     5
ln2     7     8

In [39]:
df.info() #查看dataFrame的整体结构
        #<class>表示dataFrame的类
        #index 表示索引的值和数量
        #Data columns 表示总共有多少列
        #DataFrame 表的内容
        #Non-Null Count表示值为非空的数量
        #dtypes 表示类型 
        #memory usage 表示内存

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, ln0 to ln2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [40]:
df.describe()#对dataFrame进行常见的数据分析
            #count表示列中非空值的数量
            #mean 均值
            #std 表示标准差，来数据的表示离散程度
            #min 列中最小值
            #max 列中最大值
            #25% %25的数据，第一个四分位数(下四分位数)
            #50% 50%的数据，第二个四分位数(中位数)
            #75% 75%的数据, 第三个四分位数(上四分位数)

       col1  col2
count   3.0   3.0
mean    4.0   5.0
std     3.0   3.0
min     1.0   2.0
25%     2.5   3.5
50%     4.0   5.0
75%     5.5   6.5
max     7.0   8.0

## 特征统计函数

In [41]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [42]:
df.max() #计算每列最大值

col1    7
col2    8
dtype: int64

In [43]:
df_str

  col1 col3    col2
0    a   ca       p
1    b   ac    java
2    c   cd  python

In [44]:
df_str.max()#同长度按ascll码,不同长度按字符串长度;长度相同时，依次匹配字母的ASCILL码值,直到匹配出为止

col1         c
col3        cd
col2    python
dtype: object

In [45]:
df.min()

col1    1
col2    2
dtype: int64

In [46]:
df_str.min()

col1       a
col3      ac
col2    java
dtype: object

In [47]:
df.mean()#均值

col1    4.0
col2    5.0
dtype: float64

In [48]:
df.quantile(0.25)#默认为0.5，即中位数;0.25/0.75计算上下四分位数

col1    2.5
col2    3.5
Name: 0.25, dtype: float64

In [49]:
df.count()#计算非空值的数量

col1    3
col2    3
dtype: int64

In [50]:
df.count(axis = 1)#计算行的非空值数量 默认axis = 0 即：列，axis = 1 即：行

ln0    2
ln1    2
ln2    2
dtype: int64

In [51]:
df.idxmax()#返回最大值的索引

col1    ln2
col2    ln2
dtype: object

**这些函数返回的都是标量,又称为聚合函数,其中他们都有一个参数为 axis，默认为0 即行。当为1时，为列**

# 唯一值函数

In [52]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [53]:
df['col1'].unique()#返回不重复的值的第一次出现的值，按照dataFrame列中原本的数据

array([1, 4, 7])

In [54]:
df['col1'].nunique(dropna = True)#不重复值的数量
                                #dropna默认为True 不会缺失值作为特殊的一个值计算
                                #dropna为False时 会吧缺失值作为一个特殊值计算

3

In [55]:
df['col1'].value_counts()#返回重复出现的值和他的重复数量 默认按照频数从高到低排序

col1
1    1
4    1
7    1
Name: count, dtype: int64

In [56]:
df_csv = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')

In [57]:
df_csv

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,C,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,D,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,A,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,A,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,D,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [58]:
df_demo = df_csv[['School','Transfer','Gender']]

In [59]:
df_demo

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
..     ...      ...     ...
195      C        N  Female
196      D        N  Female
197      A        N  Female
198      A        N    Male
199      D        N    Male

[200 rows x 3 columns]

In [60]:
df_demo.drop_duplicates()#m默认比较所有行，将不重复的值输出出来

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
5        D        N  Female
9        B        N  Female
12       A      NaN  Female
16       D        N    Male
21       A      NaN    Male
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
74       D        Y    Male
84       C      NaN  Female
102      B      NaN    Male
120      B      NaN  Female
131      C        Y    Male

In [61]:
df_demo.drop_duplicates(['School','Transfer'])#指定行，根据指定的行比较值是否重复，将不重复的值输出出来

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
3        C        N  Female
5        D        N  Female
12       A      NaN  Female
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
84       C      NaN  Female
102      B      NaN    Male
131      C        Y    Male

In [62]:
df_demo.drop_duplicates(keep = 'last')#keep 默认为first 保留第一次出现的行
                                    #last 保留最后一次出现的行
                                    # False 不保留重复的行，若重复则删去

    School Transfer  Gender
21       A      NaN    Male
54       B        Y    Male
84       C      NaN  Female
123      A      NaN  Female
127      B        N    Male
131      C        Y    Male
147      B      NaN    Male
150      D        Y    Male
152      C        N    Male
169      D        Y  Female
176      D      NaN  Female
185      B        N  Female
194      B      NaN  Female
195      C        N  Female
196      D        N  Female
197      A        N  Female
198      A        N    Male
199      D        N    Male

In [63]:
df_demo.drop_duplicates(keep = 'first')

    School Transfer  Gender
0        A        N  Female
1        B        N    Male
2        A        N    Male
3        C        N  Female
4        C        N    Male
5        D        N  Female
9        B        N  Female
12       A      NaN  Female
16       D        N    Male
21       A      NaN    Male
36       B        Y    Male
43       D        Y  Female
69       D      NaN  Female
74       D        Y    Male
84       C      NaN  Female
102      B      NaN    Male
120      B      NaN  Female
131      C        Y    Male

In [64]:
df_demo.drop_duplicates(keep = False)

    School Transfer  Gender
21       A      NaN    Male
84       C      NaN  Female
131      C        Y    Male

In [65]:

df_demo.duplicated(['School','Transfer']).head() #比较列中元素是否与前面的列中元素相同，相同则标记为True，否则为False

0    False
1    False
2     True
3    False
4     True
dtype: bool

# 替换函数

(1) 映射替换 使用replace函数 将指定的值替换为其他值

(2) 逻辑替换  

(3) 正则替换

### 映射替换

In [66]:
df_demo['Gender'].replace({'Male':1,'Female':0}).head() #将Gender列中的male替换为1，Female替换为0

C:\Users\15784\AppData\Local\Temp\ipykernel_3272\1266145858.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_demo['Gender'].replace({'Male':1,'Female':0}).head() #将Gender列中的male替换为1，Female替换为0

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [67]:
df_demo['Gender'].replace(['Male','Female'],[1,0]).head()#将Gender列中的male替换为1，Female替换为0b

C:\Users\15784\AppData\Local\Temp\ipykernel_3272\3548204170.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_demo['Gender'].replace(['Male','Female'],[1,0]).head()#将Gender列中的male替换为1，Female替换为0b

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [68]:
s = pd.Series(data = ['a',1,2,'b',1,1,'a'])

In [69]:
s

0    a
1    1
2    2
3    b
4    1
5    1
6    a
dtype: object

In [70]:
#replace中有关键字method,其中method有ffill(向前填充),bfill(向后填充)
s.replace([1,2],method = 'ffill')#被替换的数字向前寻找替换的字母，然后变成替换的字母。

C:\Users\15784\AppData\Local\Temp\ipykernel_3272\3927072021.py:2: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method = 'ffill')#被替换的数字向前寻找替换的字母，然后变成替换的字母。

0    a
1    a
2    a
3    b
4    b
5    b
6    a
dtype: object

In [ ]:
s.replace([1,2],method = 'bfill'),#[1,2]向后寻找替换的字母,然后被替换

C:\Users\15784\AppData\Local\Temp\ipykernel_3272\3332703430.py:1: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  s.replace([1,2],method = 'bfill'),#[1,2]向后寻找替换的字母,然后被替换

(0    a
 1    b
 2    b
 3    b
 4    a
 5    a
 6    a
 dtype: object,)

In [ ]:
df

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

### 逻辑替换

In [73]:
df.where(df < 5, 0)#where (条件) 将条件为False的数据替换为被替换的数据，默认为NaN

     col1  col2
ln0     1     2
ln1     4     0
ln2     0     0

In [74]:
df.mask(df < 5, 0)#mask (条件) 将条件为true的数据替换为被替换的数据,默认为 NaN

     col1  col2
ln0     0     0
ln1     0     5
ln2     7     8

### 数值替换

In [75]:
df.abs() #取绝对值

     col1  col2
ln0     1     2
ln1     4     5
ln2     7     8

In [76]:
df_lit = pd.DataFrame(data = [[1.2345,2.3456,3.4567],
                           [-6.789,-4.1589,-9.4565]],
                    index = ['in1','ln2'],
                    columns = ['col1','col2','col3'])

In [ ]:
df_lit

       col1    col2    col3
in1  1.2345  2.3456  3.4567
ln2 -6.7890 -4.1589 -9.4565

In [ ]:
df_lit.round(2)#保留几位小数(n)

     col1  col2  col3
in1  1.23  2.35  3.46
ln2 -6.79 -4.16 -9.46

In [ ]:
df_lit.round()#默认为1

     col1  col2  col3
in1   1.0   2.0   3.0
ln2  -7.0  -4.0  -9.0

In [80]:
df_lit.clip(-4,2)#clip(下限阈值，上限阈值) 将超过的上限阈值/下限阈值的数 替换为上限阈值/下限阈值

       col1  col2  col3
in1  1.2345   2.0   2.0
ln2 -4.0000  -4.0  -4.0

# 排序函数

1. sort_values():值排序
2. sort_index():列排序

In [81]:
df_csv

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,C,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,D,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,A,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,A,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,D,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [82]:
df_csv.sort_values('Height').head() #根据身高列中的值大小进行排序，默认升序

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
143,A,Junior,Xiaoli Chu,Female,145.4,34.0,N,1,2019/11/13,0:03:56
49,C,Senior,Gaomei Lv,Female,147.3,34.0,N,2,2019/10/16,0:03:44
120,B,Sophomore,Peng Han,Female,147.8,34.0,NaN,2,2019/9/19,0:03:32
30,B,Senior,Changli Lv,Female,148.7,41.0,N,2,2019/11/13,0:04:54
139,D,Sophomore,Qiang Zhou,Female,150.5,36.0,N,1,2019/11/4,0:04:27

In [83]:
df_csv.sort_values(['Height','Weight']).head()#先根据身高进行排序，再根据体重进行排序，靠前的权重高

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
143,A,Junior,Xiaoli Chu,Female,145.4,34.0,N,1,2019/11/13,0:03:56
49,C,Senior,Gaomei Lv,Female,147.3,34.0,N,2,2019/10/16,0:03:44
120,B,Sophomore,Peng Han,Female,147.8,34.0,NaN,2,2019/9/19,0:03:32
30,B,Senior,Changli Lv,Female,148.7,41.0,N,2,2019/11/13,0:04:54
139,D,Sophomore,Qiang Zhou,Female,150.5,36.0,N,1,2019/11/4,0:04:27

In [84]:
df_csv.sort_values(['Height','Weight'],ascending = [False,True]).head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
193,D,Senior,Xiaoqiang Qin,Male,193.9,79.0,N,2,2019/11/6,0:05:09
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
134,A,Senior,Gaoli Zhao,Male,186.5,83.0,N,1,2019/9/7,0:04:14
38,B,Freshman,Qiang Han,Male,185.3,87.0,N,3,2020/1/7,0:03:58
23,A,Senior,Qiang Zheng,Male,183.9,87.0,N,1,2019/12/5,0:04:59

In [85]:
df_demo = df_csv[['Gender','School','Height','Weight']].set_index(['Gender','School'])

In [86]:
df_demo.head()

               Height  Weight
Gender School
Female A        158.9    46.0
Male   B        166.5    70.0
       A        188.9    89.0
Female C          NaN    41.0
Male   C        174.0    74.0

In [87]:
df_demo.sort_index(level = ['Gender','School']).head() #根据索引进行排序,在函数中为sort_index(level = 要根据排序的列名)

               Height  Weight
Gender School
Female A        158.9    46.0
       A        162.5    52.0
       A          NaN    48.0
       A        160.1    48.0
       A        162.4    50.0

# apply方法

apply方法对dataframe进行迭代,apply(函数)

In [88]:
df_demo.apply(lambda x:x.mean())#将括号里面的函数对每一列进行计算，并返回一个series,默认axis = 0

Height    163.218033
Weight     55.015873
dtype: float64

In [89]:
df_demo.apply((lambda x:x.mean()),axis = 1)#当axis = 1时，对表中的每一行进行函数的计算

Gender  School
Female  A         102.45
Male    B         118.25
        A         138.95
Female  C          41.00
Male    C         124.00
                   ...
Female  C          99.95
        D         105.45
        A          99.45
Male    A         123.15
        D         103.35
Length: 200, dtype: float64

appl()虽然方便，但是会消耗大量的性能，速度很慢

# 窗口

pandas中有3种窗口,滑动窗口(rolling)、扩张窗口(expanding)、指数加权(ewm)

### 滑动窗口(rolling)

In [90]:
s = pd.Series([1,2,3,4,5])
roller = s.rolling(3)#创造一个窗口数为3的窗口，window参数一定要传入
roller

Rolling [window=3,center=False,axis=0,method=single]

In [91]:
roller.mean() #返回每一个窗口的平均值，其中第一个为NaN,NaN,1;然后依次向下滑动窗口，滑动距离为默认的1

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

In [ ]:
#cov(协方差计算）
s2 = pd.Series([1,2,6,16,30])
roller.cov(s2)#计算s和s2的协方差

0     NaN
1     NaN
2     2.5
3     7.0
4    12.0
dtype: float64

In [95]:
# corr()计算线性相关(皮尔逊系数)
roller.corr(s2)

0         NaN
1         NaN
2    0.944911
3    0.970725
4    0.995402
dtype: float64

In [96]:
#还支apply持自定义参数
roller.apply(lambda x:x.mean())

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

滑窗函数:diff()、shift()、pct_change() 默认为1 当负数时为反向

In [102]:
s2

0     1
1     2
2     6
3    16
4    30
dtype: int64

In [ ]:
# diff() 前n个值做差
s2.diff(2)#这个值减去第n-1个值，并返回差值，最后返回一个series

0     NaN
1     NaN
2     5.0
3    14.0
4    24.0
dtype: float64

In [ ]:
s2.shift(2)#整体数据向下滑动n个数，2代表整体数据向下滑动2个数，且出范围的被踢出

0    NaN
1    NaN
2    1.0
3    2.0
4    6.0
dtype: float64

In [ ]:
s2.pct_change(2)#计算变换率,(该数-第前n个数)/(第前n个数)

0    NaN
1    NaN
2    5.0
3    7.0
4    4.0
dtype: float64

### 扩张函数

* 扩张窗口又称累计窗口，可以理解为一个动态长度的窗口，其窗口的大小就是从序列开始处到具体操作的对
应位置，其使用的聚合函数会作用于这些逐步扩张的窗口上。具体地说，设序列为 a1, a2, a3, a4，则其每个
位置对应的窗口即 [a1]、[a1, a2]、[a1, a2, a3]、[a1, a2, a3, a4]。

In [109]:
s2

0     1
1     2
2     6
3    16
4    30
dtype: int64

In [ ]:
s2.expanding().mean()

0      NaN
1     1.50
2     3.00
3     6.25
4    11.00
dtype: float64

# 索引

### 表（df）的列索引

In [116]:
df_csv.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
#语法：df[列名],返回一个series
df_csv['Name'].head()

0      Gaopeng Yang
1    Changqiang You
2           Mei Sun
3      Xiaojuan Sun
4       Gaojuan You
Name: Name, dtype: object

In [ ]:
#多种可以用列表将其扩进去
df_csv[['Name','Gender']].head()

             Name  Gender
0    Gaopeng Yang  Female
1  Changqiang You    Male
2         Mei Sun    Male
3    Xiaojuan Sun  Female
4     Gaojuan You    Male

In [ ]:
#语法:df.列名 只能点一个，不能点列表
df_csv.Name.head()

0      Gaopeng Yang
1    Changqiang You
2           Mei Sun
3      Xiaojuan Sun
4       Gaojuan You
Name: Name, dtype: object

### 序列的行索引

In [126]:
s = pd.Series(data = [1,2,3,4,5,6],
              index = ['a','b','c','a','a','b'])
s

a    1
b    2
c    3
a    4
a    5
b    6
dtype: int64

In [ ]:
#以字符串为行索引
#语法，df[索引名]
s['a']

a    1
a    4
a    5
dtype: int64

In [ ]:
s[['a','b']] #将列表中匹配的全部返回为一个series

a    1
a    4
a    5
b    2
b    6
dtype: int64

In [ ]:
#df.索引名
s.a

a    1
a    4
a    5
dtype: int64

In [133]:
s

a    1
b    2
c    3
a    4
a    5
b    6
dtype: int64

In [138]:
#切片
#[start:stop:step] #包含start和stop 必须指定唯一值
s_unique = pd.Series(data = [1,2,3,4,5,6,7],
                     index = ['a','b','c','d','e','f','g'])
s_unique

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [139]:
s_unique['a':'e':2]

a    1
c    3
e    5
dtype: int64

In [147]:
s = pd.Series(data = ['a','b','c','d'],
              index = [1,2,3,4])
s

1    a
2    b
3    c
4    d
dtype: object

In [ ]:
# 语法：s[列名]
s[1]

'a'

In [150]:
s[[1,2]]

1    a
2    b
dtype: object

In [ ]:
#整数切片，[start:stop:step] 不会取到stop·
s[1:3:1]

2    b
3    c
dtype: object

In [ ]:
#索引的设置不建议使用纯浮点数和混合类型，不然很有可能会报错

## 索引器

In [ ]:
# 1.loc 
# 2.iloc
# 3.[]

### loc

In [ ]:
# loc[*,*] 前面为行，后面为列
# loc[*],包含五种合法数据：单个元素,元素列表,numpy数组,切片,bool类型

In [158]:
df_csv.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [168]:
df_csv = df_csv.set_index('Name')

In [169]:
df_csv.head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
# 1.单个元素 ,表示行
df_csv.loc['Qiang Chu']

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Qiang Chu,A,Freshman,Female,162.5,52.0,N,1,2019/12/12,0:03:53
Qiang Chu,A,Senior,Female,162.4,50.0,N,3,2019/9/30,0:03:36

In [172]:
# 2.使用行列
df_csv.loc[['Qiang Chu'],['Gender']]

           Gender
Name
Qiang Chu  Female
Qiang Chu  Female

In [173]:
# 3.使用列表
df_csv.loc[['Qiang Chu'],['Gender','Height']]

           Gender  Height
Name
Qiang Chu  Female   162.5
Qiang Chu  Female   162.4

In [ ]:
#使用numpy数组
df_csv.loc[['Qiang Chu'],np.array(['Gender','Height'])]

           Gender  Height
Name
Qiang Chu  Female   162.5
Qiang Chu  Female   162.4

In [ ]:
# 使用切片
df_csv.loc['Gaopeng Yang':'Gaojuan You'].head()b

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [179]:
# 4.使用bool类型
df_csv.loc[df_csv.Height > 170].head() #将传进的参数为True的行列输出出来

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22
Xiaopeng Zhou,A,Freshman,Male,174.1,74.0,N,1,2019/9/29,0:05:16
Xiaoqiang Qin,D,Junior,Male,170.1,68.0,N,1,2019/9/11,0:04:51
Xiaofeng Sun,D,Senior,Male,170.3,71.0,N,2,2019/11/4,0:03:32

In [ ]:
#5. 可使用函数
df_csv.loc[lambda df_csv:df_csv.Height>170].head() #将符合传入的函数的结果输出出来

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22
Xiaopeng Zhou,A,Freshman,Male,174.1,74.0,N,1,2019/9/29,0:05:16
Xiaoqiang Qin,D,Junior,Male,170.1,68.0,N,1,2019/9/11,0:04:51
Xiaofeng Sun,D,Senior,Male,170.3,71.0,N,2,2019/11/4,0:03:32

### iloc

In [ ]:
#iloc[]语法和loc[]基本一致,只不过是针对位置进行筛选
# iloc[*,*]
# iloc [*]

In [184]:
df_csv.head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
# 1.单个元素
df_csv.iloc[0] #第0行的数据

School                 A
Grade           Freshman
Gender            Female
Height             158.9
Weight              46.0
Transfer               N
Test_Number            1
Test_Date      2019/10/5
Time_Record      0:04:34
Name: Gaopeng Yang, dtype: object

In [ ]:
# 2.行列
df_csv.iloc[1,1]#第二行第二列的数据

'Freshman'

In [ ]:
#1.列表/数组
df_csv.iloc[[1,2,3],[1,2,3]] #输出第2、3、4行的第2、3、4列

                    Grade  Gender  Height
Name
Changqiang You   Freshman    Male   166.5
Mei Sun            Senior    Male   188.9
Xiaojuan Sun    Sophomore  Female     NaN

In [ ]:
# 切片
#iloc[切片1，切片2]，
# iloc[*] 里面可以为list和array，但不能为series
df_csv.iloc[1:4,1:4]

                    Grade  Gender  Height
Name
Changqiang You   Freshman    Male   166.5
Mei Sun            Senior    Male   188.9
Xiaojuan Sun    Sophomore  Female     NaN

In [ ]:
#4. 可执行函数类型
df_csv.iloc[lambda df_csv:[0,2]].head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22

In [ ]:
a = [1,2,3]
def lt(lst):
    return lst
df_csv.iloc[lambda df_csv:lt(a)].head() #函数返回为列表

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08

In [ ]:
df_csv.iloc[lambda df_csv:slice(0,4)].head() #slice 为切片

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08

In [197]:
# 5.bool数组
df_csv.iloc[list(df_csv.Height > 170)].head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22
Xiaopeng Zhou,A,Freshman,Male,174.1,74.0,N,1,2019/9/29,0:05:16
Xiaoqiang Qin,D,Junior,Male,170.1,68.0,N,1,2019/9/11,0:04:51
Xiaofeng Sun,D,Senior,Male,170.3,71.0,N,2,2019/11/4,0:03:32

In [198]:
# 通常切片
df_csv[1:5]

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22

### query

In [200]:
df_csv.head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaojuan Sun,C,Sophomore,Female,NaN,41.0,N,2,2020/1/3,0:04:08
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
#将字符串中的类型返回为bool数组来进行查询
df_csv.query('Height > 170').head() #将height > 50的值返回

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22
Xiaopeng Zhou,A,Freshman,Male,174.1,74.0,N,1,2019/9/29,0:05:16
Xiaoqiang Qin,D,Junior,Male,170.1,68.0,N,1,2019/9/11,0:04:51
Xiaofeng Sun,D,Senior,Male,170.3,71.0,N,2,2019/11/4,0:03:32

In [ ]:
## query方法中引用带空格的列明
    # 对于带空格的列明，需要使用 (反引号) `col name`的方式进行引用

In [ ]:
# or 或者
# and 且
# in ==
# not in !=
df_csv.query("Grade in ['Senior','Freshman']").head()

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Gaopeng Yang,A,Freshman,Female,158.9,46.0,N,1,2019/10/5,0:04:34
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Mei Sun,A,Senior,Male,188.9,89.0,N,2,2019/9/12,0:05:22
Xiaoli Qian,D,Freshman,Female,158.0,51.0,N,1,2019/10/31,0:03:47
Qiang Chu,A,Freshman,Female,162.5,52.0,N,1,2019/12/12,0:03:53

In [ ]:
a = 70
b = 80
df_csv.query('Weight.between(@a,@b)').head()#between(@参数,@另一个参数) 在参数和另一个参数之间 a>x>b

,School,Grade,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
Name,,,,,,,,,
Changqiang You,B,Freshman,Male,166.5,70.0,N,1,2019/9/4,0:04:20
Gaojuan You,C,Sophomore,Male,174.0,74.0,N,2,2019/11/6,0:05:22
Xiaopeng Zhou,A,Freshman,Male,174.1,74.0,N,1,2019/9/29,0:05:16
Xiaofeng Sun,D,Senior,Male,170.3,71.0,N,2,2019/11/4,0:03:32
Gaoli Zhao,B,Freshman,Male,175.4,78.0,N,2,2019/10/8,0:03:32

# 随机抽样

In [ ]:
#sample()
df_sample = pd.DataFrame({'id':list('abcde'),'value':[1,2,3,4,80]})
df_sample

  id  value
0  a      1
1  b      2
2  c      3
3  d      4
4  e     80

In [ ]:
df_sample.sample(3,replace = True) #抽3次,replace = True时为有放回抽样。replace = False时为无放回抽样

  id  value
2  c      3
0  a      1
4  e     80